class ValueError():
    pass
def intersectionAreaRect():
    x1_1 = input("Введите координату по оси Ox левого нижнего угла прямоугольника: ")
    y1_1 = input("Введите координату по оси Oy левого нижнего угла прямоугольника: ")
    x2_1 = input("Введите координату по оси Ox правого верхнего угла прямоугольника:")
    y2_1 = input("Введите координату по оси Oy правого верхнего угла прямоугольника:")
    list1 = [(x1_1, y1_1), (x2_1, y2_1)]
    x1_2 = input("Введите координату по оси Ox левого нижнего угла прямоугольника: ")
    y1_2 = input("Введите координату по оси Oy левого нижнего угла прямоугольника: ")
    x2_2 = input("Введите координату по оси Ox правого верхнего угла прямоугольника:")
    y2_2 = input("Введите координату по оси Oy правого верхнего угла прямоугольника:")
    list2 = [(x1_2, y1_2), (x2_2, y2_2)]
    left=max(x1_1,x1_2)
    bottom = max(y1_1, y1_2) 
    right = min(x2_1, x2_2)
    top = min(y2_1, y2_2)
    width=right-left
    height=top-bottom
    if (width <= 0 or height <= 0):
        print(0)
    elif(list1[0][0]>list1[1][0] or list1[0][1]>list1[1][1] or list2[0][0]>list2[1][0] or list2[0][0]>list2[1][0]):
        raise ValueError("В функцию передан некорректный прямоугольник")
    else:
        print(width*height)