class RectCorrectError(Exception):
   pass
def isCollisionRect():
    x1_1 = input("Введите координату по оси Ox левого нижнего угла прямоугольника: ")
    y1_1 = input("Введите координату по оси Oy левого нижнего угла прямоугольника: ")
    x2_1 = input("Введите координату по оси Ox правого верхнего угла прямоугольника:")
    y2_1 = input("Введите координату по оси Oy правого верхнего угла прямоугольника:")
    list1 = [(x1_1, y1_1), (x2_1, y2_1)]
    x1_2 = input("Введите координату по оси Ox левого нижнего угла прямоугольника: ")
    y1_2 = input("Введите координату по оси Oy левого нижнего угла прямоугольника: ")
    x2_2 = input("Введите координату по оси Ox правого верхнего угла прямоугольника:")
    y2_2 = input("Введите координату по оси Oy правого верхнего угла прямоугольника:")
    list2 = [(x1_2, y1_2), (x2_2, y2_2)]
    if(list1[0][0]>list1[1][0] or list1[0][1]>list1[1][1]):
        raise RectCorrectError('1й прямоугольник некоректный')
    elif(list2[0][0]>list2[1][0] or list2[0][0]>list2[1][0]):
        raise RectCorrectError('2й прямоугольник некоректный')
    elif((x2_1<x1_2) or (x2_2<x1_1)):
        print("False")
    elif((y1_1<y2_2) or (y1_2<y2_1)):
        print("False")
    else:
        print("True")